app/Controllers/usuario_controller.php

	public function formValidation(){

		$input = $this->validate([
			'nombre'	=> 'required|min_length[3]',
			'apellido'	=> 'required|min_length[3]|max_length[25]',
			'usuario'	=> 'required|min_length[3]',
			'email'		=> 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuario.email]',
			'pass'		=> 'required|min_length[8]|max_length[20]',
		],
	);
	$formModel = new usuario_model();

	if (!$input){
		$data['titulo']='Registro';
        echo view('front/head_view',$data);
        echo view('front/navbar_view');
        echo view('back/usuario/registro', ['validation' => $this->validator]);
        echo view('front/footer_view');
	} else {
		$formModel->save([
			'nombre'	=> $this->request->getVar('nombre'),
			'apellido' 	=> $this->request->getVar('apellido'),
			'usuario'	=> $this->request->getVar('usuario'),
			'email' 	=> $this->request->getVar('email'),
			'pass'	 	=> password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT),

			]);
---
INSERT INTO `usuario` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('exequiel', 'echavarria', 'exequiel', 'exequiel2@mail.com', '$2y$10$MjPGl2eGZLIY5muHj0lj6O2o7EmDu3TYCRGm0umRE/bYCnNH02/tW')